<?php
use think\Request;
// +----------------------------------------------------------------------
// | wsq 万事墙
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: baozi <768588658@qq.com>
// +----------------------------------------------------------------------
/*
模块函数目录，用于存放当前模块的公共函数
*/

    function paramCheck()
    {
        //获取访问的控制类 模块、控制器、操作
        $request = Request::instance();
        // echo "当前模块名称是" . $request->module();
        // echo "当前控制器名称是" . $request->controller();
        // echo "当前操作名称是" . $request->action();
        // die;
        //根据模块和方法进入switch判断验证
        
        //写公用的验证条目，哪一个需要直接引用
        //例如不能为空、正则、之类
        # code...
    }



 ?>
